---
title: "练习"
date: 2023-02-21T12:13:26+08:00
summary: "斐波那契数列,打印菱形"
---

1. 斐波那契数列,打印第30项
   #+begin_src python :results output
a=0
b=1
count=1
print(count,b)
while True:
    count+=1
    if count>30:
        break
    a,b=b,a+b
    print(count,b)
   #+end_src

   #+RESULTS:
   #+begin_example
   1 1
   2 1
   3 2
   4 3
   5 5
   6 8
   7 13
   8 21
   9 34
   10 55
   11 89
   12 144
   13 233
   14 377
   15 610
   16 987
   17 1597
   18 2584
   19 4181
   20 6765
   21 10946
   22 17711
   23 28657
   24 46368
   25 75025
   26 121393
   27 196418
   28 317811
   29 514229
   30 832040
   #+end_example

2. 打印菱形
   #+begin_src python :results output
n=7
e=n//2
for i in range(-e,e+1):
    print(' '*abs(i),'*'*(n-2*abs(i)),sep='')
   #+end_src

   #+RESULTS:
   :    *
   :   ***
   :  *****
   : *******
   :  *****
   :   ***
   :    *
